using System;

//Напишете програма, която приема за вход четирицифрено число във формат abcd  (например числото 2011) и след това извършва следните действия върху него:

// -     Пресмята сбора от цифрите на числото(за нашия пример 2+0+1+1 = 4).

// -     Разпечатва на конзолата цифрите в обратен ред: dcba(за нашия пример резултатът е 1102).

// -     Поставя последната цифра, на първо място: dabc(за нашия пример резултатът е 1201).

// -     Разменя мястото на втората и третата цифра: acbd(за нашия пример резултатът е 2101).

class Program
{
    static void Main()
    {
        int n = 2011;
        int a, b, c, d;
       
        d = n % 10;

        c = n / 10; // c = (n / 10) % 10;
        c = c % 10;

        b = n / 100;
        b = b % 10;

        a = n / 1000;
        a = a % 10;

        Console.WriteLine("{0}, {1}, {2}, {3}" , a, b, c, d);
        Console.WriteLine("Сборът е = {0} ", a + b + c + d);
        Console.WriteLine("{0}, {1}, {2}, {3}", d, c, b, a);
        Console.WriteLine("{0}, {1}, {2}, {3}", d, a, b, c);
        Console.WriteLine("{0}, {1}, {2}, {3}", a, c, b, d);
    }
}

