using System;

// Напишете програма, която проверява дали дадена точка О (x, y) е вътре в окръжността К ((0,0), 5) и едновременно с това извън право­ъгълника ((-1, 1), (5, 5). 
// Пояснение: правоъгълникът е зададен чрез координатите на горния си ляв и долния си десен ъгъл.

class Program
{
    static void Main()
    {
        int x = 20;
        int y = 2;
        Console.WriteLine("The point is inside of circle, rectangle: {0}", x * x + y * y < 5 * 5 && x > -1 && y > 1 && x < 5 && y < 5);
    }
}

